d = {
  'apple': ['malum', 'pomum', 'popula'],
  'fruit': ['baca', 'bacca', 'popum'],
  'punishment': ['malum', 'multa']
}
new = {}
for key, wely in d.items():
  for i in wely:
    if i not in new:
      new [i] = [key]
    else:
      new[i].append(key)
print(new)
# Даний словник ключами якого є англійські слова, а значення списки латинських слів.
# Потрібно розгорнути словник.
# Іншими словами, необхідно, на підставі заданого словника, створити новий словник,
# у якого як ключі будуть взяті латинські слова, з першого словника, а значеннями будуть англійські слова,
# що відповідають їм.